In [1]:
import numpy as np
import pandas as pd

In [14]:
labels = ["a","b","c"]
np_arr = np.arange(5)
my_data = [10,20,30]
d = {"a":10, "b":20, "c":30}

In [10]:
pd.Series(data=np_arr)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [11]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(np_arr)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [16]:
#Series from Dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [28]:
s1 = pd.Series([200,245,294,210], ["India", "USA", "France", "Germany"])
print(s1)

India      200
USA        245
France     294
Germany    210
dtype: int64

In [29]:
s1.USA

245

In [30]:
s1["USA"]

245

## Dataframe

In [50]:
df = pd.DataFrame(np.random.randn(5,4), columns=["Col1","Col2", "Col3","Col4"])
print(df)

       Col1      Col2      Col3      Col4
0  0.327845  0.674485 -0.174057  0.780140
1 -0.383258 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393 -1.522333
3  1.133703  0.528187  0.393461 -0.630507
4 -1.398290 -0.219311 -0.045676  0.012421

In [53]:
df.Col1

0    0.327845
1   -0.383258
2   -0.982776
3    1.133703
4   -1.398290
Name: Col1, dtype: float64

In [54]:
type(df.Col1)

pandas.core.series.Series

In [58]:
#Get a new datframe with only two columns
df[["Col1","Col2"]]

       Col1      Col2
0  0.327845  0.674485
1 -0.383258 -0.409318
2 -0.982776  2.231555
3  1.133703  0.528187
4 -1.398290 -0.219311

In [59]:
#Add a new column
df["new"] = np.random.randn(5)

In [60]:
df

       Col1      Col2      Col3      Col4       new
0  0.327845  0.674485 -0.174057  0.780140  0.093628
1 -0.383258 -0.409318  0.343539  0.196275  1.240813
2 -0.982776  2.231555 -0.971393 -1.522333 -1.097693
3  1.133703  0.528187  0.393461 -0.630507 -1.908009
4 -1.398290 -0.219311 -0.045676  0.012421 -0.380104

In [62]:
#axis 1 suggest that to search it in columns
df.drop("new", axis=1)

       Col1      Col2      Col3      Col4
0  0.327845  0.674485 -0.174057  0.780140
1 -0.383258 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393 -1.522333
3  1.133703  0.528187  0.393461 -0.630507
4 -1.398290 -0.219311 -0.045676  0.012421

In [64]:
df

       Col1      Col2      Col3      Col4       new
0  0.327845  0.674485 -0.174057  0.780140  0.093628
1 -0.383258 -0.409318  0.343539  0.196275  1.240813
2 -0.982776  2.231555 -0.971393 -1.522333 -1.097693
3  1.133703  0.528187  0.393461 -0.630507 -1.908009
4 -1.398290 -0.219311 -0.045676  0.012421 -0.380104

In [65]:
#axis 1 suggest that to search it in columns
# adding inplace arg to make our changes stay 
df.drop("new", axis=1, inplace=True)

In [68]:
df

       Col1      Col2      Col3      Col4
0  0.327845  0.674485 -0.174057  0.780140
1 -0.383258 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393 -1.522333
3  1.133703  0.528187  0.393461 -0.630507
4 -1.398290 -0.219311 -0.045676  0.012421

In [71]:
#Drop rows
df.drop(4, axis=0)

       Col1      Col2      Col3      Col4
0  0.327845  0.674485 -0.174057  0.780140
1 -0.383258 -0.409318  0.343539  0.196275
2 -0.982776  2.231555 -0.971393 -1.522333
3  1.133703  0.528187  0.393461 -0.630507

In [80]:
#Finding data
df.loc[0]

Col1    0.327845
Col2    0.674485
Col3   -0.174057
Col4    0.780140
Name: 0, dtype: float64

In [87]:
##get the first row with index 0 and only first three columns
df.iloc[0,0:3]

Col1    0.327845
Col2    0.674485
Col3   -0.174057
Name: 0, dtype: float64

In [88]:
#get the second row with index 1 and only three columns
df.loc[1,["Col1","Col2","Col3"]]

Col1   -0.383258
Col2   -0.409318
Col3    0.343539
Name: 1, dtype: float64

In [89]:
df.loc[[0,1],["Col1","Col2","Col3"]]

       Col1      Col2      Col3
0  0.327845  0.674485 -0.174057
1 -0.383258 -0.409318  0.343539

## MultiIndexing

In [95]:
#MultiIndex
grade = ["G1","G2","G2","G1","G2"]
sal = [2,5,6,3,1]
hier_index=  list(zip(grade, sal))
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3, 5, 6]],
           codes=[[0, 1, 1, 0, 1], [1, 3, 4, 2, 0]])

In [98]:
df = pd.DataFrame(np.random.randn(5,2), index =hier_index, columns= ["Col1","Col2"])

In [99]:
df

          Col1      Col2
G1 2 -0.415191  0.053661
G2 5 -2.115113 -0.279510
   6  1.062710  1.752014
G1 3  0.695547  0.153661
G2 1  0.167638 -0.765930

In [102]:
df.loc["G1"].loc[2]

Col1   -0.415191
Col2    0.053661
Name: 2, dtype: float64

In [103]:
df.index.names = ["Grade", "Salary"]

In [104]:
df

                  Col1      Col2
Grade Salary
G1    2      -0.415191  0.053661
G2    5      -2.115113 -0.279510
      6       1.062710  1.752014
G1    3       0.695547  0.153661
G2    1       0.167638 -0.765930

In [107]:
df.xs("G2")

            Col1      Col2
Salary
5      -2.115113 -0.279510
6       1.062710  1.752014
1       0.167638 -0.765930

In [108]:
df.xs(1,level="Salary")

           Col1     Col2
Grade
G2     0.167638 -0.76593

## Handling missing data

In [111]:
df =  pd.DataFrame(data  = {"Col1":[np.nan,56,98], 
                            "Col2":[np.nan, np.nan,32],
                            "Col3":[98,65,56]})

In [112]:
df

   Col1  Col2  Col3
0   NaN   NaN    98
1  56.0   NaN    65
2  98.0  32.0    56

In [113]:
#drops any column with one or more null values 
# use inplace to make changes to the original df
df.dropna()

   Col1  Col2  Col3
2  98.0  32.0    56

In [114]:
#drops any column with one or more null values 
# use inplace to make changes to the original df
df.dropna(axis=1)

   Col3
0    98
1    65
2    56

In [116]:
#Use threshold  to Require that many non-NA values.
# Simply it means that drop rows where there are >=2 null values in a row
df.dropna(thresh=2)

   Col1  Col2  Col3
1  56.0   NaN    65
2  98.0  32.0    56

In [144]:
#filling the null values
print(df.fillna(value=-1, axis=1))

   Col1  Col2  Col3
0  -1.0  -1.0    98
1  56.0  -1.0    65
2  98.0  32.0    56

In [142]:
# different types of filling techniques
print("Original Df")
print(df)
print("\nBackward Fill (Column wise)")
print(df.bfill(axis=1))
print("\nForward Fill (Column wise)")
print(df.ffill(axis=1))
print("\nFilling with a limit (Column wise)")
print (df.bfill(limit=1, axis=1))

Original Df
   Col1  Col2  Col3
0   NaN   NaN    98
1  56.0   NaN    65
2  98.0  32.0    56

Backward Fill (Column wise)
   Col1  Col2  Col3
0  98.0  98.0  98.0
1  56.0  65.0  65.0
2  98.0  32.0  56.0

Forward Fill (Column wise)
   Col1  Col2  Col3
0   NaN   NaN  98.0
1  56.0  56.0  65.0
2  98.0  32.0  56.0

Filling with a limit (Column wise)
   Col1  Col2  Col3
0   NaN  98.0  98.0
1  56.0  65.0  65.0
2  98.0  32.0  56.0

In [145]:
#filling with different values
df.Col1.fillna(value =df.Col1.mean())

0    77.0
1    56.0
2    98.0
Name: Col1, dtype: float64

## GroupBy

In [188]:
data = {"Company":["GOOG", "GOOG", "MSFT", "FB", "FB", "MSFT"],
       "Person":["S", "C", "A", "V", "C", "B"],
       "Sales":[200,120,340,124,125,602]}

df = pd.DataFrame(data=data)
df

  Company Person  Sales
0    GOOG      S    200
1    GOOG      C    120
2    MSFT      A    340
3      FB      V    124
4      FB      C    125
5    MSFT      B    602

In [149]:
df.groupby("Company").mean()

         Sales
Company
FB       363.5
GOOG     160.0
MSFT     232.0

In [150]:
df.groupby("Company").sum()

         Sales
Company
FB         727
GOOG       320
MSFT       464

In [152]:
df.groupby("Company").std()

              Sales
Company
FB       337.289935
GOOG      56.568542
MSFT     152.735065

In [153]:
df.groupby("Company").sum().loc["FB"]

Sales    727
Name: FB, dtype: int64

In [154]:
df.groupby("Company").count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [155]:
df.groupby("Company").max()

        Person  Sales
Company
FB           C    602
GOOG         S    200
MSFT         V    340

In [158]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  363.5  337.289935  125.0  244.25  363.5  482.75  602.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [159]:
x = df.groupby("Company")

In [195]:
#This gives the difference with previous rows
x.diff()

   Sales
0    NaN
1  -80.0
2    NaN
3 -216.0
4    NaN
5  477.0

## Merging and Joining

## Operations

In [223]:
np.random.seed(568)
df = pd.DataFrame(np.random.randint(1,20, 20).reshape(5,4), columns=["Col1","Col2", "Col3","Col4"])
df["Names"] = ["Cathy", "John", "Bruno", "Calvin", "Sara"]
df

   Col1  Col2  Col3  Col4   Names
0     7     2    18    12   Cathy
1     1    16     1    13    John
2     7     8    19    19   Bruno
3    19    11     7    16  Calvin
4    17     3     9     2    Sara

In [225]:
#Apply is one of the most strongest and valuable function on df
df.Col1.apply(lambda x: x*2)

0    14
1     2
2    14
3    38
4    34
Name: Col1, dtype: int64

In [237]:
df.iloc[1,:4].apply(lambda x: x/2)

Col1    0.5
Col2    8.0
Col3    0.5
Col4    6.5
Name: 1, dtype: float64

In [238]:
df["len_of_names"] = df.Names.apply(len)

In [239]:
df

   Col1  Col2  Col3  Col4   Names  len_of_names
0     7     2    18    12   Cathy             5
1     1    16     1    13    John             4
2     7     8    19    19   Bruno             5
3    19    11     7    16  Calvin             6
4    17     3     9     2    Sara             4

In [243]:
df["Col1*Col2"] = df.Col1 * df.Col2

In [244]:
df

   Col1  Col2  Col3  Col4   Names  len_of_names  Col1*Col2
0     7     2    18    12   Cathy             5         14
1     1    16     1    13    John             4         16
2     7     8    19    19   Bruno             5         56
3    19    11     7    16  Calvin             6        209
4    17     3     9     2    Sara             4         51

In [245]:
#get names of a columns
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Names', 'len_of_names', 'Col1*Col2'], dtype='object')

In [253]:
#Get only the columns specified by using names
new_df= df[["Col1", "Col2","Col3", "Col4"]]
new_df

   Col1  Col2  Col3  Col4
0     7     2    18    12
1     1    16     1    13
2     7     8    19    19
3    19    11     7    16
4    17     3     9     2

In [254]:
#Sorting columns
new_df.sort_values(by="Col2")

   Col1  Col2  Col3  Col4
0     7     2    18    12
4    17     3     9     2
2     7     8    19    19
3    19    11     7    16
1     1    16     1    13

In [256]:
new_df.isnull()

    Col1   Col2   Col3   Col4
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False

In [ ]:
## ADD pivoting examples